programs 
zsh
oh my zsh
zsh plugins 
	fzf-tab
	zsh-autosuggestions
nvm
git 
curl
wget
curlie
cheat.sh
htop
ksysguard
nvim
dbeaver
vscode
powerline fonts
spaceship theme
batcat
rg
ranger
fdfind
xclip
vlc
indicator-stickynotes
Bitwarden
spotify

libinput-gestures

kid3
docker-compose
docker
Menlo-for-Powerline


typora
npm i -g prettier eslint nodemon

picard
spek
slack
lollypop

gnome-tweaks










```
gnome-extensions list                                             

clipboard-indicator@tudmotu.com
Vitals@CoreCoding.com
CoverflowAltTab@palatis.blogspot.com
color-picker@tuberry
apps-menu@gnome-shell-extensions.gcampax.github.com
auto-move-windows@gnome-shell-extensions.gcampax.github.com
drive-menu@gnome-shell-extensions.gcampax.github.com
horizontal-workspaces@gnome-shell-extensions.gcampax.github.com
launch-new-instance@gnome-shell-extensions.gcampax.github.com
native-window-placement@gnome-shell-extensions.gcampax.github.com
places-menu@gnome-shell-extensions.gcampax.github.com
remove-dropdown-arrows@mpdeimos.com
screenshot-window-sizer@gnome-shell-extensions.gcampax.github.com
user-theme@gnome-shell-extensions.gcampax.github.com
window-list@gnome-shell-extensions.gcampax.github.com
windowsNavigator@gnome-shell-extensions.gcampax.github.com
workspace-indicator@gnome-shell-extensions.gcampax.github.com
x11gestures@joseexposito.github.io
zorin-appindicator@zorinos.com
zorin-connect@zorinos.com
zorin-desktop-icons@zorinos.com
zorin-magic-lamp-effect@zorinos.com
zorin-menu@zorinos.com
zorin-printers@zorinos.com
zorin-taskbar@zorinos.com
zorin-window-move-effect@zorinos.com


gnome-extensions list --enabled


clipboard-indicator@tudmotu.com
Vitals@CoreCoding.com
CoverflowAltTab@palatis.blogspot.com
color-picker@tuberry
drive-menu@gnome-shell-extensions.gcampax.github.com
remove-dropdown-arrows@mpdeimos.com
user-theme@gnome-shell-extensions.gcampax.github.com
workspace-indicator@gnome-shell-extensions.gcampax.github.com
x11gestures@joseexposito.github.io
zorin-appindicator@zorinos.com
zorin-desktop-icons@zorinos.com
zorin-menu@zorinos.com
zorin-printers@zorinos.com
zorin-taskbar@zorinos.com

```


```
installed pacakges
adduser
apt-transport-https
apt-utils
apt
autoconf
autotools-dev
base-files
base-passwd
bash
bat
bitwarden
bleachbit
bsdutils
build-essential
bzip2
ca-certificates
caffeine
code
console-setup-linux
console-setup
containerd.io
coreutils
cron
curl
dash
dbeaver-ce
dbus
debconf-i18n
debconf
debianutils
diffutils
distro-info-data
dmsetup
docker-ce-cli
docker-ce
dpkg
e2fsprogs
efibootmgr
eject
fd-find
fdisk
file
findutils
firefox-locale-en
fonts-beng-extra
fonts-croscore
fonts-dejavu-core
fonts-deva-extra
fonts-droid-fallback
fonts-freefont-ttf
fonts-gargi
fonts-gubbi
fonts-gujr-extra
fonts-guru-extra
fonts-inter-zorin-os
fonts-jetbrains-mono-zorin-os
fonts-kacst-one
fonts-kacst
fonts-kalapi
fonts-khmeros-core
fonts-lao
fonts-liberation2
fonts-liberation
fonts-lklug-sinhala
fonts-lohit-beng-assamese
fonts-lohit-beng-bengali
fonts-lohit-deva
fonts-lohit-gujr
fonts-lohit-guru
fonts-lohit-knda
fonts-lohit-mlym
fonts-lohit-orya
fonts-lohit-taml-classical
fonts-lohit-taml
fonts-lohit-telu
fonts-lyx
fonts-michroma-zorin-os
fonts-nakula
fonts-navilu
fonts-noto-cjk-extra
fonts-noto-cjk
fonts-noto-color-emoji
fonts-noto-core
fonts-noto-extra
fonts-noto-mono
fonts-noto-ui-core
fonts-noto-ui-extra
fonts-noto-unhinted
fonts-open-sans
fonts-opendyslexic
fonts-opensymbol
fonts-orya-extra
fonts-pagul
fonts-powerline
fonts-roboto-mono-zorin-os
fonts-roboto-unhinted
fonts-sahadeva
fonts-samyak-deva
fonts-samyak-gujr
fonts-samyak-mlym
fonts-samyak-taml
fonts-sans-forgetica-zorin-os
fonts-sarai
fonts-sil-abyssinica
fonts-sil-mondulkiri
fonts-sil-padauk
fonts-smc-anjalioldlipi
fonts-smc-chilanka
fonts-smc-dyuthi
fonts-smc-gayathri
fonts-smc-karumbi
fonts-smc-keraleeyam
fonts-smc-manjari
fonts-smc-meera
fonts-smc-rachana
fonts-smc-raghumalayalamsans
fonts-smc-suruma
fonts-smc-uroob
fonts-space-grotesk-zorin-os
fonts-telu-extra
fonts-tibetan-machine
fonts-tiresias
fonts-tlwg-garuda-ttf
fonts-tlwg-kinnari-ttf
fonts-tlwg-laksaman-ttf
fonts-tlwg-loma-ttf
fonts-tlwg-mono-ttf
fonts-tlwg-norasi-ttf
fonts-tlwg-purisa-ttf
fonts-tlwg-sawasdee-ttf
fonts-tlwg-typewriter-ttf
fonts-tlwg-typist-ttf
fonts-tlwg-typo-ttf
fonts-tlwg-umpush-ttf
fonts-tlwg-waree-ttf
fonts-ubuntu
fonts-urw-base35
fonts-yrsa-rasa
fzf
gcc-10-base
gir1.2-glib-2.0
git
gnome-tweak-tool
gnupg
google-chrome-stable
gpgv
grep
grsync
gzip
hostname
hunspell-en-us
hyphen-en-us
init-system-helpers
init
intltool
iproute2
iputils-ping
isc-dhcp-client
isc-dhcp-common
kbd
keyboard-configuration
kid3-qt
kmod
konsole
ksysguard
ktorrent
language-pack-en
language-pack-gnome-en
less
libacl1
libapparmor1
libapt-pkg6.0
libargon2-1
libatm1
libattr1
libaudit-common
libaudit1
libavcodec-dev
libavformat-dev
libblkid1
libbsd0
libbz2-1.0
libc-bin
libc6
libcap-ng0
libcap2-bin
libcap2
libcom-err2
libcrypt1
libcryptsetup12
libdb5.3
libdbus-1-3
libdebconfclient0
libdevmapper1.02.1
libdns-export1109
libegl-dev
libelf1
libestr0
libexpat1
libext2fs2
libfastjson4
libfdisk1
libffi7
libfribidi0
libgcc-s1
libgcrypt20
libgirepository-1.0-1
libgl-dev
libgl1-mesa-dev
libgles-dev
libgles1
libglib2.0-0
libglib2.0-data
libglu1-mesa-dev
libglvnd-dev
libglx-dev
libgmp10
libgnutls30
libgpg-error0
libhogweed5
libicu66
libidn2-0
libinput-tools
libip4tc2
libisc-export1105
libjson-c4
libkmod2
liblocale-gettext-perl
liblz4-1
liblzma5
libmagic-mgc
libmagic1
libmnl0
libmount1
libmpdec2
libncurses6
libncursesw5-dev
libncursesw6
libnetplan0
libnettle7
libnewt0.52
libnss-systemd
libopengl-dev
libp11-kit0
libpam-cap
libpam-modules-bin
libpam-modules
libpam-runtime
libpam-systemd
libpam0g
libpcre2-8-0
libpcre3
libpopt0
libprocps8
libpthread-stubs0-dev
libpython3-stdlib
libpython3.8-minimal
libpython3.8-stdlib
libreadline8
libreoffice-help-en-us
libseccomp2
libselinux1
libsemanage-common
libsemanage1
libsepol1
libslang2
libsmartcols1
libsodium23
libsqlite3-0
libss2
libssl1.1
libstdc++6
libsystemd0
libtasn1-6
libtext-charwidth-perl
libtext-iconv-perl
libtext-wrapi18n-perl
libtinfo6
libudev1
libunistring2
libuuid1
libwxbase3.0-dev
libwxgtk3.0-gtk3-0v5
libx11-dev
libxau-dev
libxcb1-dev
libxdmcp-dev
libxml2
libxtables12
libyaml-0-2
libzstd1
linux-generic-hwe-20.04
linux-headers-5.13.0-51-generic
linux-hwe-5.13-headers-5.13.0-51
linux-image-5.13.0-51-generic
linux-modules-5.13.0-51-generic
linux-modules-extra-5.13.0-51-generic
locales
login
logrotate
logsave
lollypop
lsb-base
lsb-release
mawk
mime-support
mount
mythes-en-us
ncurses-base
ncurses-bin
neofetch
neovim
netbase
netcat-openbsd
netplan.io
networkd-dispatcher
openssl
passwd
perl-base
picard
poppler-data
procps
python3-cffi-backend
python3-dbus
python3-gi
python3-minimal
python3-nacl
python3-netifaces
python3-pkg-resources
python3-pymacaroons
python3-six
python3-yaml
python3.8-minimal
python3.8
python3
ranger
readline-common
ripgrep
rsyslog
sed
sensible-utils
shared-mime-info
shotwell
slack-desktop
snapd
software-properties-common
spotify-client
sublime-merge
sublime-text
sudo
systemd-sysv
systemd-timesyncd
systemd
sysvinit-utils
tar
tree
ttf-bitstream-vera
typora
tzdata
ubuntu-keyring
ubuntu-restricted-extras
ucf
udev
util-linux
vim-common
vim-tiny
vim
vlc
wamerican
wbritish
whiptail
wmctrl
wx-common
wx3.0-headers
x11proto-core-dev
x11proto-dev
xclip
xdg-user-dirs
xdotool
xfonts-base
xfonts-encodings
xfonts-scalable
xfonts-utils
xkb-data
xorg-sgml-doctools
xserver-xorg
xtrans-dev
xxd
xz-utils
zlib1g
zorin-os-desktop
zorin-os-keyring
zorin-os-minimal
zorin-os-standard
zsh
```
